stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_hal_pwr.h
/**
  ******************************************************************************
  * @file    stm32u3xx_hal_pwr.h
  * @author  GPM Application Team
  * @brief   Header file of PWR HAL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32U3xx_HAL_PWR_H
#define STM32U3xx_HAL_PWR_H

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/* Includes ------------------------------------------------------------------*/
#include "stm32u3xx_hal_def.h"

/** @addtogroup STM32U3xx_HAL_Driver
  * @{
  */

/** @addtogroup PWR
  * @{
  */

/* Exported types ------------------------------------------------------------*/

/** @defgroup PWR_Exported_Types PWR Exported Types
  * @{
  */

/**
  * @brief  PWR PVD configuration structure definition
  */
typedef struct
{
  uint32_t PVDLevel; /*!< Specifies the PVD detection level.
                          This parameter can be a value of
                          @ref PWR_PVD_Detection_Level.                       */

  uint32_t Mode;     /*!< Specifies the operating mode for the selected lines.
                          This parameter can be a value of @ref PWR_PVD_Mode. */
} PWR_PVDTypeDef;

/**
  * @brief  PWR PVM configuration structure definition
  */
typedef struct
{
  uint32_t PVMType;   /*!< Specifies which voltage is monitored.
                           This parameter can be a value of
                           @ref PWR_PVM_Type.                               */

  uint32_t Mode;      /*!< Specifies the operating mode for the selected lines.
                           This parameter can be a value of
                           @ref PWR_PVM_Mode.                               */
} PWR_PVMTypeDef;
/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/

/** @defgroup PWR_Exported_Constants PWR Exported Constants
  * @{
  */

/** @defgroup PWR_PVD_Detection_Level Programmable Voltage Detection Level
  * @{
  */
#define PWR_PVDLEVEL_0                 (0U)                                    /*!< PVD threshold around 2.0 V       */
#define PWR_PVDLEVEL_1                 PWR_SVMCR_PVDLS_0                       /*!< PVD threshold around 2.2 V       */
#define PWR_PVDLEVEL_2                 PWR_SVMCR_PVDLS_1                       /*!< PVD threshold around 2.4 V       */
#define PWR_PVDLEVEL_3                 (PWR_SVMCR_PVDLS_0 | PWR_SVMCR_PVDLS_1) /*!< PVD threshold around 2.5 V       */
#define PWR_PVDLEVEL_4                 PWR_SVMCR_PVDLS_2                       /*!< PVD threshold around 2.6 V       */
#define PWR_PVDLEVEL_5                 (PWR_SVMCR_PVDLS_0 | PWR_SVMCR_PVDLS_2) /*!< PVD threshold around 2.8 V       */
#define PWR_PVDLEVEL_6                 (PWR_SVMCR_PVDLS_1 | PWR_SVMCR_PVDLS_2) /*!< PVD threshold around 2.9 V       */
#define PWR_PVDLEVEL_7                 PWR_SVMCR_PVDLS                         /*!< External input analog voltage
                                                                                    (compared internally to VREFINT) */
/**
  * @}
  */

/** @defgroup PWR_PVD_Mode PWR PVD Mode
  * @{
  */
#define PWR_PVD_MODE_NORMAL               (0x00U)                              /*!< Basic Mode is used                */
#define PWR_PVD_MODE_IT_RISING            (0x05U)                              /*!< External Interrupt Mode with Rising
                                                                                    edge trigger detection            */
#define PWR_PVD_MODE_IT_FALLING           (0x06U)                              /*!< External Interrupt Mode with Falling
                                                                                    edge trigger detection            */
#define PWR_PVD_MODE_IT_RISING_FALLING    (0x07U)                              /*!< External Interrupt Mode with Rising/
                                                                                    Falling edge trigger detection    */
#define PWR_PVD_MODE_EVENT_RISING         (0x09U)                              /*!< Event Mode with Rising edge trigger
                                                                                    detection                         */
#define PWR_PVD_MODE_EVENT_FALLING        (0x0AU)                              /*!< Event Mode with Falling edge trigger
                                                                                    detection                         */
#define PWR_PVD_MODE_EVENT_RISING_FALLING (0x0BU)                              /*!< Event Mode with Rising/Falling edge
                                                                                    trigger detection                 */
/**
  * @}
  */

/** @defgroup PWR_PVM_Mode PWR PVM Interrupt and Event Mode
  * @{
  */
#define PWR_PVM_MODE_NORMAL               (0x00U) /*!< Basic Mode is used                                             */
#define PWR_PVM_MODE_IT_RISING            (0x05U) /*!< External Interrupt Mode with Rising edge trigger detection     */
#define PWR_PVM_MODE_IT_FALLING           (0x06U) /*!< External Interrupt Mode with Falling edge trigger detection    */
#define PWR_PVM_MODE_IT_RISING_FALLING    (0x07U) /*!< External Interrupt Mode with Rising/Falling edge trigger
                                                        detection                                                     */
#define PWR_PVM_MODE_EVENT_RISING         (0x09U) /*!< Event Mode with Rising edge trigger detection                  */
#define PWR_PVM_MODE_EVENT_FALLING        (0x0AU) /*!< Event Mode with Falling edge trigger detection                 */
#define PWR_PVM_MODE_EVENT_RISING_FALLING (0x0BU) /*!< Event Mode with Rising/Falling edge trigger detection          */
/**
  * @}
  */

/** @defgroup PWR_Regulator_In_LowPower_Mode PWR Regulator State in Sleep/Stop Mode
  * @{
  */
#define PWR_MAINREGULATOR_ON           (0U)                                  /*!< Main Regulator ON in Run Mode       */
#define PWR_LOWPOWERREGULATOR_ON       PWR_CR1_LPMS_0                        /*!< Main Regulator ON in Low Power Mode */
/**
  * @}
  */

/** @defgroup PWR_Low_Power_Mode_Selection  PWR Low Power Mode Selection
  * @{
  */
#define PWR_LOWPOWERMODE_STOP0    (0U)                                /*!< Stop 0: stop mode with main regulator      */
#define PWR_LOWPOWERMODE_STOP1    PWR_CR1_LPMS_0                      /*!< Stop 1: stop mode with low power regulator */
#define PWR_LOWPOWERMODE_STOP2    PWR_CR1_LPMS_1                      /*!< Stop 2: stop mode with low power regulator */
#define PWR_LOWPOWERMODE_STOP3    (PWR_CR1_LPMS_0 | PWR_CR1_LPMS_1)   /*!< Stop 3: stop mode with low power regulator */
/**
  * @}
  */

/** @defgroup PWR_Sleep_Mode_Entry PWR Sleep Mode Entry
  * @{
  */
#define PWR_SLEEPENTRY_WFI              (1U)  /*!< Wait For Interruption instruction to enter Sleep mode              */
#define PWR_SLEEPENTRY_WFE              (2U)  /*!< Wait For Event instruction to enter Sleep mode                     */
#define PWR_SLEEPENTRY_WFE_NO_EVT_CLEAR (3U)  /*!< Wait For Event instruction to enter Sleep mode with no event clear */
/**
  * @}
  */

