stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_hal_pwr.h
/** @defgroup PWR_Stop_Mode_Entry PWR Stop Mode Entry
  * @{
  */
#define PWR_STOPENTRY_WFI              (1U)    /*!< Wait For Interruption instruction to enter Stop mode              */
#define PWR_STOPENTRY_WFE              (2U)    /*!< Wait For Event instruction to enter Stop mode                     */
#define PWR_STOPENTRY_WFE_NO_EVT_CLEAR (3U)    /*!< Wait For Event instruction to enter Stop mode with no event clear */
/**
  * @}
  */

/** @defgroup PWR_Flags PWR Flags
  * @{
  */
#define PWR_FLAG_STOPF                 (0x1U)                        /*!< Stop flag                                   */
#define PWR_FLAG_SBF                   (0x2U)                        /*!< Standby flag                                */
#define PWR_FLAG_R1RDY                 (0x3U)                        /*!< Voltage range 1 selection ready flag        */
#define PWR_FLAG_R2RDY                 (0x4U)                        /*!< Voltage range 2 selection ready flag        */
#define PWR_FLAG_BOOSTRDY              (0x5U)                        /*!< EPOD booster ready flag                     */
#define PWR_FLAG_PVDO                  (0x6U)                        /*!< VDD voltage detector output flag            */
#define PWR_FLAG_REGS                  (0x7U)                        /*!< Regulator selection flag                    */
#define PWR_FLAG_VDDA1RDY              (0x8U)                        /*!< VDDA ready versus 1.6V voltage monitor flag */
#define PWR_FLAG_VDDA2RDY              (0x9U)                        /*!< VDDA ready versus 1.8V voltage monitor flag */
#if defined(PWR_SVMSR_VDDIO2RDY)
#define PWR_FLAG_VDDIO2RDY             (0xAU)                        /*!< VDDIO2 ready voltage monitor flag           */
#endif /* PWR_SVMSR_VDDIO2RDY */
#define PWR_FLAG_VDDUSBRDY             (0xBU)                        /*!< VDDUSB ready voltage monitor flag           */
/**
  * @}
  */

/** @defgroup PWR_WakeUp_Lines_Flags PWR Wakeup Lines Flags
  * @{
  */
#define PWR_WAKEUP_FLAG1               (0x10U)                                 /*!< Wakeup flag 1   */
#define PWR_WAKEUP_FLAG2               (0x20U)                                 /*!< Wakeup flag 2   */
#define PWR_WAKEUP_FLAG3               (0x30U)                                 /*!< Wakeup flag 3   */
#define PWR_WAKEUP_FLAG4               (0x40U)                                 /*!< Wakeup flag 4   */
#define PWR_WAKEUP_FLAG5               (0x50U)                                 /*!< Wakeup flag 5   */
#define PWR_WAKEUP_FLAG6               (0x60U)                                 /*!< Wakeup flag 6   */
#define PWR_WAKEUP_FLAG7               (0x70U)                                 /*!< Wakeup flag 7   */
#define PWR_WAKEUP_FLAG8               (0x80U)                                 /*!< Wakeup flag 8   */
#define PWR_WAKEUP_FLAG9               (0x90U)                                 /*!< Wakeup flag 9   */
#define PWR_WAKEUP_FLAG10              (0xA0U)                                 /*!< Wakeup flag 10  */
#define PWR_WAKEUP_ALL_FLAG            (0xB0U)                                 /*!< Wakeup flag all */
/**
  * @}
  */

/** @defgroup PWR_WakeUp_Line_ PWR Wake Up Lines
  * @{
  */

/* (Default polarity and default line selection) */
#define PWR_WAKEUP_LINE1               PWR_WUCR1_WUPEN1                     /*!< PA0  : Wakeup line 1 (high polarity) */
#define PWR_WAKEUP_LINE2               PWR_WUCR1_WUPEN2                     /*!< PA4  : Wakeup line 2 (high polarity) */
#define PWR_WAKEUP_LINE3               PWR_WUCR1_WUPEN3                     /*!< PE6  : Wakeup line 3 (high polarity) */
#define PWR_WAKEUP_LINE4               PWR_WUCR1_WUPEN4                     /*!< PA2  : Wakeup line 4 (high polarity) */
#define PWR_WAKEUP_LINE5               PWR_WUCR1_WUPEN5                     /*!< PC5  : Wakeup line 4 (high polarity) */
#define PWR_WAKEUP_LINE6               PWR_WUCR1_WUPEN6                     /*!< PB5  : Wakeup line 6 (high polarity) */
#define PWR_WAKEUP_LINE7               PWR_WUCR1_WUPEN7                     /*!< PB15 : Wakeup line 7 (high polarity) */
#define PWR_WAKEUP_LINE8               PWR_WUCR1_WUPEN8                     /*!< reserved                             */
#define PWR_WAKEUP_LINE9               PWR_WUCR1_WUPEN9                     /*!< I3C1 reset pattern                   */
#define PWR_WAKEUP_LINE10              PWR_WUCR1_WUPEN10                    /*!< I3C2 reset pattern                   */

/* PWR Wakeup line polarity */
#define PWR_WAKEUP_POLARITY_HIGH       (0U)                                 /*!< High polarity */
#define PWR_WAKEUP_POLARITY_LOW        (1U)                                 /*!< Low polarity  */

/* PWR Wakeup line selection */
#define PWR_WAKEUP_SELECT_0            (0U)                                 /*!< Wake up 0 selected */
#define PWR_WAKEUP_SELECT_1            (1U)                                 /*!< Wake up 1 selected */
#define PWR_WAKEUP_SELECT_2            (2U)                                 /*!< Wake up 2 selected */
#define PWR_WAKEUP_SELECT_3            (3U)                                 /*!< Wake up 3 selected */
/**
  * @}
  */

/** @defgroup PWR_Secure_Items PWR Secure Items
  * @{
  */
#define PWR_WKUP1                      PWR_SECCFGR_WUP1SEC    /*!< WUP1 secure protection                             */
#define PWR_WKUP2                      PWR_SECCFGR_WUP2SEC    /*!< WUP2 secure protection                             */
#define PWR_WKUP3                      PWR_SECCFGR_WUP3SEC    /*!< WUP3 secure protection                             */
#define PWR_WKUP4                      PWR_SECCFGR_WUP4SEC    /*!< WUP4 secure protection                             */
#define PWR_WKUP5                      PWR_SECCFGR_WUP5SEC    /*!< WUP5 secure protection                             */
#define PWR_WKUP6                      PWR_SECCFGR_WUP6SEC    /*!< WUP6 secure protection                             */
#define PWR_WKUP7                      PWR_SECCFGR_WUP7SEC    /*!< WUP7 secure protection                             */
#define PWR_WKUP8                      PWR_SECCFGR_WUP8SEC    /*!< WUP8 secure protection                             */
#define PWR_WKUP9                      PWR_SECCFGR_WUP9SEC    /*!< WUP9 secure protection                             */
#define PWR_WKUP10                     PWR_SECCFGR_WUP10SEC   /*!< WUP10 secure protection                            */
#define PWR_LPM                        PWR_SECCFGR_LPMSEC     /*!< Low power modes secure protection                  */
#define PWR_VDM                        PWR_SECCFGR_VDMSEC     /*!< Voltage detection and monitoring secure protection */
#define PWR_VB                         PWR_SECCFGR_VBSEC      /*!< Backup domain secure protection                    */
#define PWR_APC                        PWR_SECCFGR_APCSEC     /*!< Pull-up/pull-down secure protection                */
#define PWR_ALL                        (PWR_WKUP1 | PWR_WKUP2 | PWR_WKUP3 | PWR_WKUP4 | PWR_WKUP5  |\
                                        PWR_WKUP6 | PWR_WKUP7 | PWR_WKUP8 | PWR_WKUP9 | PWR_WKUP10 |\
                                        PWR_LPM   | PWR_VDM   | PWR_VB    | PWR_APC)
/**
  * @}
  */

/** @defgroup PWR_Attributes PWR Attributes
  * @brief PWR Privilege/NPrivilege and Secure/NSecure Attributes
  * @{
  */
#define PWR_NSEC_PRIV                  (PWR_ITEM_ATTR_NSEC_PRIV_MASK | 0x01U)  /*!< NSecure and Privileged attribute  */
#define PWR_NSEC_NPRIV                 PWR_ITEM_ATTR_NSEC_PRIV_MASK            /*!< NSecure and NPrivileged attribute */
#define PWR_SEC_PRIV                   (PWR_ITEM_ATTR_SEC_PRIV_MASK  | 0x02U)  /*!< Secure and Privileged attribute   */
#define PWR_SEC_NPRIV                  PWR_ITEM_ATTR_SEC_PRIV_MASK             /*!< Secure and NPrivileged attribute  */
/**
  * @}
  */

/**
  * @}
  */

/* Exported macros -----------------------------------------------------------*/

/** @defgroup PWR_Exported_Macros PWR Exported Macros
  * @{
  */

#if defined(PWR_SVMSR_VDDIO2RDY)
/** @brief  Check PWR flags are set or not.
  * @param  __FLAG__ : Specifies the flag to check.
  *                    This parameter can be one of the following values when available :
  *                    @arg @ref PWR_FLAG_STOPF     : Stop flag.
  *                                                   Indicates that the device was resumed from Stop mode.
  *                    @arg @ref PWR_FLAG_SBF       : Standby flag.
  *                                                   Indicates that the device was resumed from Standby mode.
  *                    @arg @ref PWR_FLAG_R1RDY     : Ready bit for VCORE voltage range 1.
  *                                                   Indicates that Vcore is equal or above VOS range 1 level.
  *                    @arg @ref PWR_FLAG_R2RDY     : Ready bit for VCORE voltage range 2.
  *                                                   Indicates that Vcore is equal or above VOS range 2 level.
  *                    @arg @ref PWR_FLAG_BOOSTRDY  : EPOD booster ready flag.
  *                                                   Indicates that the Power booster is ready.
  *                    @arg @ref PWR_FLAG_PVDO      : Voltage detector output flag.
  *                                                   Indicates that Vdd is equal or above
  *                                                   the PVD threshold selected by PVDLS.
  *                    @arg @ref PWR_FLAG_REGS      : Regulator selection flag.
  *                                                   Indicates the regulator selected.
  *                    @arg @ref PWR_FLAG_VDDA1RDY  : VDDA ready versus 1.6V voltage monitor flag.
  *                                                   Indicates VDDA is equal or above the threshold of the
  *                                                   VDDA voltage monitor 1 (around 1.6V).
  *                    @arg @ref PWR_FLAG_VDDA2RDY  : VDDA ready versus 1.8V voltage monitor flag.
  *                                                   Indicates VDDA is equal or above the threshold of the
  *                                                   VDDA voltage monitor 1 (around 1.8V).
  *                    @arg @ref PWR_FLAG_VDDIO2RDY  : VDDIO2 ready flag.
  *                                                   Indicates VDDIO2 is equal or above the threshold of the
  *                                                   VDDIO2 voltage monitor.
  *                    @arg @ref PWR_FLAG_VDDUSBRDY  : VDDUSB ready flag.
  *                                                   Indicates VDDUSB is equal or above the threshold of the
  *                                                   VDDUSB voltage monitor.
  *                    @arg @ref PWR_WAKEUP_FLAG1   : Wakeup flag 1.
  *                                                   Indicates that a wakeup event was received from the WKUP line 1.
  *                    @arg @ref PWR_WAKEUP_FLAG2   : Wakeup flag 2.
  *                                                   Indicates that a wakeup event was received from the WKUP line 2.
  *                    @arg @ref PWR_WAKEUP_FLAG3   : Wakeup flag 3.
  *                                                   Indicates that a wakeup event was received from the WKUP line 3.
  *                    @arg @ref PWR_WAKEUP_FLAG4   : Wakeup flag 4.
  *                                                   Indicates that a wakeup event was received from the WKUP line 4.
  *                    @arg @ref PWR_WAKEUP_FLAG5   : Wakeup flag 5.
  *                                                   Indicates that a wakeup event was received from the WKUP line 5.
  *                    @arg @ref PWR_WAKEUP_FLAG6   : Wakeup flag 6.
  *                                                   Indicates that a wakeup event was received from the WKUP line 6.
  *                    @arg @ref PWR_WAKEUP_FLAG7   : Wakeup flag 7.
  *                                                   Indicates that a wakeup event was received from the WKUP line 7.
  *                    @arg @ref PWR_WAKEUP_FLAG8   : Wakeup flag 8.
  *                                                   Indicates that a wakeup event was received from the WKUP line 8.
  *                    @arg @ref PWR_WAKEUP_FLAG9   : Wakeup flag 9.
  *                                                   Indicates that a wakeup event was received from the WKUP line 9.
  *                    @arg @ref PWR_WAKEUP_FLAG10  : Wakeup flag 10.
  *                                                   Indicates that a wakeup event was received from the WKUP line 10.
  * @retval The state of __FLAG__ (TRUE or FALSE).
  */
#define __HAL_PWR_GET_FLAG(__FLAG__)                                                                         \
  (                                                                                                          \
    ((__FLAG__) == PWR_FLAG_STOPF)     ? (READ_BIT(PWR->SR, PWR_SR_STOPF)           == PWR_SR_STOPF)       : \
    ((__FLAG__) == PWR_FLAG_SBF)       ? (READ_BIT(PWR->SR, PWR_SR_SBF)             == PWR_SR_SBF)         : \
    ((__FLAG__) == PWR_FLAG_R1RDY)     ? (READ_BIT(PWR->VOSR, PWR_VOSR_R1RDY)       == PWR_VOSR_R1RDY)     : \
    ((__FLAG__) == PWR_FLAG_R2RDY)     ? (READ_BIT(PWR->VOSR, PWR_VOSR_R2RDY)       == PWR_VOSR_R2RDY)     : \
    ((__FLAG__) == PWR_FLAG_BOOSTRDY)  ? (READ_BIT(PWR->VOSR, PWR_VOSR_BOOSTRDY)    == PWR_VOSR_BOOSTRDY)  : \
    ((__FLAG__) == PWR_FLAG_PVDO)      ? (READ_BIT(PWR->SVMSR, PWR_SVMSR_PVDO)      == PWR_SVMSR_PVDO)     : \
    ((__FLAG__) == PWR_FLAG_REGS)      ? (READ_BIT(PWR->SVMSR, PWR_SVMSR_REGS)      == PWR_SVMSR_REGS)     : \
    ((__FLAG__) == PWR_FLAG_VDDA1RDY)  ? (READ_BIT(PWR->SVMSR, PWR_SVMSR_VDDA1RDY)  == PWR_SVMSR_VDDA1RDY) : \
    ((__FLAG__) == PWR_FLAG_VDDA2RDY)  ? (READ_BIT(PWR->SVMSR, PWR_SVMSR_VDDA2RDY)  == PWR_SVMSR_VDDA2RDY) : \
    ((__FLAG__) == PWR_FLAG_VDDIO2RDY) ? (READ_BIT(PWR->SVMSR, PWR_SVMSR_VDDIO2RDY) == PWR_SVMSR_VDDIO2RDY): \
    ((__FLAG__) == PWR_FLAG_VDDUSBRDY) ? (READ_BIT(PWR->SVMSR, PWR_SVMSR_VDDUSBRDY) == PWR_SVMSR_VDDUSBRDY): \
    ((__FLAG__) == PWR_WAKEUP_FLAG1)   ? (READ_BIT(PWR->WUSR, PWR_WUSR_WUF1)        == PWR_WUSR_WUF1)      : \
    ((__FLAG__) == PWR_WAKEUP_FLAG2)   ? (READ_BIT(PWR->WUSR, PWR_WUSR_WUF2)        == PWR_WUSR_WUF2)      : \
    ((__FLAG__) == PWR_WAKEUP_FLAG3)   ? (READ_BIT(PWR->WUSR, PWR_WUSR_WUF3)        == PWR_WUSR_WUF3)      : \
    ((__FLAG__) == PWR_WAKEUP_FLAG4)   ? (READ_BIT(PWR->WUSR, PWR_WUSR_WUF4)        == PWR_WUSR_WUF4)      : \
    ((__FLAG__) == PWR_WAKEUP_FLAG5)   ? (READ_BIT(PWR->WUSR, PWR_WUSR_WUF5)        == PWR_WUSR_WUF5)      : \
    ((__FLAG__) == PWR_WAKEUP_FLAG6)   ? (READ_BIT(PWR->WUSR, PWR_WUSR_WUF6)        == PWR_WUSR_WUF6)      : \
    ((__FLAG__) == PWR_WAKEUP_FLAG7)   ? (READ_BIT(PWR->WUSR, PWR_WUSR_WUF7)        == PWR_WUSR_WUF7)      : \
    ((__FLAG__) == PWR_WAKEUP_FLAG8)   ? (READ_BIT(PWR->WUSR, PWR_WUSR_WUF8)        == PWR_WUSR_WUF8)      : \
    ((__FLAG__) == PWR_WAKEUP_FLAG9)   ? (READ_BIT(PWR->WUSR, PWR_WUSR_WUF9)        == PWR_WUSR_WUF9)      : \
    (READ_BIT(PWR->WUSR, PWR_WUSR_WUF10) == PWR_WUSR_WUF10))
#else
/** @brief  Check PWR flags are set or not.
  * @param  __FLAG__ : Specifies the flag to check.
  *                    This parameter can be one of the following values when available :
  *                    @arg @ref PWR_FLAG_STOPF     : Stop flag.
  *                                                   Indicates that the device was resumed from Stop mode.
  *                    @arg @ref PWR_FLAG_SBF       : Standby flag.
  *                                                   Indicates that the device was resumed from Standby mode.
  *                    @arg @ref PWR_FLAG_R1RDY     : Ready bit for VCORE voltage range 1.
  *                                                   Indicates that Vcore is equal or above VOS range 1 level.
  *                    @arg @ref PWR_FLAG_R2RDY     : Ready bit for VCORE voltage range 2.
  *                                                   Indicates that Vcore is equal or above VOS range 2 level.
  *                    @arg @ref PWR_FLAG_BOOSTRDY  : EPOD booster ready flag.
  *                                                   Indicates that the Power booster is ready.
  *                    @arg @ref PWR_FLAG_PVDO      : Voltage detector output flag.
  *                                                   Indicates that Vdd is equal or above
  *                                                   the PVD threshold selected by PVDLS.
  *                    @arg @ref PWR_FLAG_REGS      : Regulator selection flag.
  *                                                   Indicates the regulator selected.
  *                    @arg @ref PWR_FLAG_VDDA1RDY  : VDDA ready versus 1.6V voltage monitor flag.
  *                                                   Indicates VDDA is equal or above the threshold of the
  *                                                   VDDA voltage monitor 1 (around 1.6V).
  *                    @arg @ref PWR_FLAG_VDDA2RDY  : VDDA ready versus 1.8V voltage monitor flag.
  *                                                   Indicates VDDA is equal or above the threshold of the
  *                                                   VDDA voltage monitor 1 (around 1.8V).
  *                    @arg @ref PWR_FLAG_VDDUSBRDY  : VDDUSB ready flag.
  *                                                   Indicates VDDUSB is equal or above the threshold of the
  *                                                   VDDUSB voltage monitor.
  *                    @arg @ref PWR_WAKEUP_FLAG1   : Wakeup flag 1.
  *                                                   Indicates that a wakeup event was received from the WKUP line 1.
  *                    @arg @ref PWR_WAKEUP_FLAG2   : Wakeup flag 2.
  *                                                   Indicates that a wakeup event was received from the WKUP line 2.
  *                    @arg @ref PWR_WAKEUP_FLAG3   : Wakeup flag 3.
  *                                                   Indicates that a wakeup event was received from the WKUP line 3.
  *                    @arg @ref PWR_WAKEUP_FLAG4   : Wakeup flag 4.
  *                                                   Indicates that a wakeup event was received from the WKUP line 4.
  *                    @arg @ref PWR_WAKEUP_FLAG5   : Wakeup flag 5.
  *                                                   Indicates that a wakeup event was received from the WKUP line 5.
  *                    @arg @ref PWR_WAKEUP_FLAG6   : Wakeup flag 6.
  *                                                   Indicates that a wakeup event was received from the WKUP line 6.
  *                    @arg @ref PWR_WAKEUP_FLAG7   : Wakeup flag 7.
  *                                                   Indicates that a wakeup event was received from the WKUP line 7.
  *                    @arg @ref PWR_WAKEUP_FLAG8   : Wakeup flag 8.
  *                                                   Indicates that a wakeup event was received from the WKUP line 8.
  *                    @arg @ref PWR_WAKEUP_FLAG9   : Wakeup flag 9.
  *                                                   Indicates that a wakeup event was received from the WKUP line 9.
  *                    @arg @ref PWR_WAKEUP_FLAG10  : Wakeup flag 10.
  *                                                   Indicates that a wakeup event was received from the WKUP line 10.
  * @retval The state of __FLAG__ (TRUE or FALSE).
  */
#define __HAL_PWR_GET_FLAG(__FLAG__)                                                                         \
  (                                                                                                          \
    ((__FLAG__) == PWR_FLAG_STOPF)     ? (READ_BIT(PWR->SR, PWR_SR_STOPF)           == PWR_SR_STOPF)       : \
    ((__FLAG__) == PWR_FLAG_SBF)       ? (READ_BIT(PWR->SR, PWR_SR_SBF)             == PWR_SR_SBF)         : \
    ((__FLAG__) == PWR_FLAG_R1RDY)     ? (READ_BIT(PWR->VOSR, PWR_VOSR_R1RDY)       == PWR_VOSR_R1RDY)     : \
    ((__FLAG__) == PWR_FLAG_R2RDY)     ? (READ_BIT(PWR->VOSR, PWR_VOSR_R2RDY)       == PWR_VOSR_R2RDY)     : \
    ((__FLAG__) == PWR_FLAG_BOOSTRDY)  ? (READ_BIT(PWR->VOSR, PWR_VOSR_BOOSTRDY)    == PWR_VOSR_BOOSTRDY)  : \
    ((__FLAG__) == PWR_FLAG_PVDO)      ? (READ_BIT(PWR->SVMSR, PWR_SVMSR_PVDO)      == PWR_SVMSR_PVDO)     : \
    ((__FLAG__) == PWR_FLAG_REGS)      ? (READ_BIT(PWR->SVMSR, PWR_SVMSR_REGS)      == PWR_SVMSR_REGS)     : \
    ((__FLAG__) == PWR_FLAG_VDDA1RDY)  ? (READ_BIT(PWR->SVMSR, PWR_SVMSR_VDDA1RDY)  == PWR_SVMSR_VDDA1RDY) : \
    ((__FLAG__) == PWR_FLAG_VDDA2RDY)  ? (READ_BIT(PWR->SVMSR, PWR_SVMSR_VDDA2RDY)  == PWR_SVMSR_VDDA2RDY) : \
    ((__FLAG__) == PWR_FLAG_VDDUSBRDY) ? (READ_BIT(PWR->SVMSR, PWR_SVMSR_VDDUSBRDY) == PWR_SVMSR_VDDUSBRDY): \
    ((__FLAG__) == PWR_WAKEUP_FLAG1)   ? (READ_BIT(PWR->WUSR, PWR_WUSR_WUF1)        == PWR_WUSR_WUF1)      : \
    ((__FLAG__) == PWR_WAKEUP_FLAG2)   ? (READ_BIT(PWR->WUSR, PWR_WUSR_WUF2)        == PWR_WUSR_WUF2)      : \
    ((__FLAG__) == PWR_WAKEUP_FLAG3)   ? (READ_BIT(PWR->WUSR, PWR_WUSR_WUF3)        == PWR_WUSR_WUF3)      : \
    ((__FLAG__) == PWR_WAKEUP_FLAG4)   ? (READ_BIT(PWR->WUSR, PWR_WUSR_WUF4)        == PWR_WUSR_WUF4)      : \
    ((__FLAG__) == PWR_WAKEUP_FLAG5)   ? (READ_BIT(PWR->WUSR, PWR_WUSR_WUF5)        == PWR_WUSR_WUF5)      : \
    ((__FLAG__) == PWR_WAKEUP_FLAG6)   ? (READ_BIT(PWR->WUSR, PWR_WUSR_WUF6)        == PWR_WUSR_WUF6)      : \
    ((__FLAG__) == PWR_WAKEUP_FLAG7)   ? (READ_BIT(PWR->WUSR, PWR_WUSR_WUF7)        == PWR_WUSR_WUF7)      : \
    ((__FLAG__) == PWR_WAKEUP_FLAG8)   ? (READ_BIT(PWR->WUSR, PWR_WUSR_WUF8)        == PWR_WUSR_WUF8)      : \
    ((__FLAG__) == PWR_WAKEUP_FLAG9)   ? (READ_BIT(PWR->WUSR, PWR_WUSR_WUF9)        == PWR_WUSR_WUF9)      : \
    (READ_BIT(PWR->WUSR, PWR_WUSR_WUF10) == PWR_WUSR_WUF10))
#endif /* PWR_SVMSR_VDDIO2RDY */

