stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_hal_pwr.h
/** @brief  Clear PWR flags.
  * @param  __FLAG__ : Specifies the flag to clear.
  *                    This parameter can be one of the following values when available:
  *                    @arg @ref PWR_FLAG_STOPF      : Stop flag.
  *                                                    Indicates that the device was resumed from Stop mode.
  *                    @arg @ref PWR_FLAG_SBF        : Standby flag.
  *                                                    Indicates that the device was resumed from Standby mode.
  *                    @arg @ref PWR_WAKEUP_FLAG1    : Wakeup flag 1.
  *                                                    Indicates that a wakeup event was received from the WKUP line 1.
  *                    @arg @ref PWR_WAKEUP_FLAG2    : Wakeup flag 2.
  *                                                    Indicates that a wakeup event was received from the WKUP line 2.
  *                    @arg @ref PWR_WAKEUP_FLAG3    : Wakeup flag 3.
  *                                                    Indicates that a wakeup event was received from the WKUP line 3.
  *                    @arg @ref PWR_WAKEUP_FLAG4    : Wakeup flag 4.
  *                                                    Indicates that a wakeup event was received from the WKUP line 4.
  *                    @arg @ref PWR_WAKEUP_FLAG5    : Wakeup flag 5.
  *                                                    Indicates that a wakeup event was received from the WKUP line 5.
  *                    @arg @ref PWR_WAKEUP_FLAG6    : Wakeup flag 6.
  *                                                    Indicates that a wakeup event was received from the WKUP line 6.
  *                    @arg @ref PWR_WAKEUP_FLAG7    : Wakeup flag 7.
  *                                                    Indicates that a wakeup event was received from the WKUP line 7.
  *                    @arg @ref PWR_WAKEUP_FLAG8    : Wakeup flag 8.
  *                                                    Indicates that a wakeup event was received from the WKUP line 8.
  *                    @arg @ref PWR_WAKEUP_FLAG9    : Wakeup flag 9.
  *                                                    Indicates that a wakeup event was received from the WKUP line 9.
  *                    @arg @ref PWR_WAKEUP_FLAG10   : Wakeup flag 10.
  *                                                    Indicates that a wakeup event was received from the WKUP line 10.
  *                    @arg @ref PWR_WAKEUP_ALL_FLAG : all Wakeup flags.
  * @retval None.
  */
#define __HAL_PWR_CLEAR_FLAG(__FLAG__)                                             \
(                                                                                  \
    ((__FLAG__) == PWR_FLAG_STOPF)    ? (SET_BIT(PWR->SR, PWR_SR_CSSF))          : \
    ((__FLAG__) == PWR_FLAG_SBF)      ? (SET_BIT(PWR->SR, PWR_SR_CSSF))          : \
    ((__FLAG__) == PWR_WAKEUP_FLAG1)  ? (WRITE_REG(PWR->WUSCR, PWR_WUSCR_CWUF1)) : \
    ((__FLAG__) == PWR_WAKEUP_FLAG2)  ? (WRITE_REG(PWR->WUSCR, PWR_WUSCR_CWUF2)) : \
    ((__FLAG__) == PWR_WAKEUP_FLAG3)  ? (WRITE_REG(PWR->WUSCR, PWR_WUSCR_CWUF3)) : \
    ((__FLAG__) == PWR_WAKEUP_FLAG4)  ? (WRITE_REG(PWR->WUSCR, PWR_WUSCR_CWUF4)) : \
    ((__FLAG__) == PWR_WAKEUP_FLAG5)  ? (WRITE_REG(PWR->WUSCR, PWR_WUSCR_CWUF5)) : \
    ((__FLAG__) == PWR_WAKEUP_FLAG6)  ? (WRITE_REG(PWR->WUSCR, PWR_WUSCR_CWUF6)) : \
    ((__FLAG__) == PWR_WAKEUP_FLAG7)  ? (WRITE_REG(PWR->WUSCR, PWR_WUSCR_CWUF7)) : \
    ((__FLAG__) == PWR_WAKEUP_FLAG8)  ? (WRITE_REG(PWR->WUSCR, PWR_WUSCR_CWUF8)) : \
    ((__FLAG__) == PWR_WAKEUP_FLAG9)  ? (WRITE_REG(PWR->WUSCR, PWR_WUSCR_CWUF9)) : \
    ((__FLAG__) == PWR_WAKEUP_FLAG10) ? (WRITE_REG(PWR->WUSCR, PWR_WUSCR_CWUF10)): \
    (WRITE_REG(PWR->WUSCR, (PWR_WUSCR_CWUF1 | PWR_WUSCR_CWUF2 | PWR_WUSCR_CWUF3 | PWR_WUSCR_CWUF4 | PWR_WUSCR_CWUF5 | \
                            PWR_WUSCR_CWUF6 | PWR_WUSCR_CWUF7 | PWR_WUSCR_CWUF8 | PWR_WUSCR_CWUF9 | PWR_WUSCR_CWUF10))))

/**
  * @brief  Enable the PVD Interrupt Line.
  * @retval None.
  */
#define __HAL_PWR_PVD_EXTI_ENABLE_IT() SET_BIT(EXTI->IMR1, PWR_EXTI_LINE_PVD)

/**
  * @brief  Disable the PVD Interrupt Line.
  * @retval None.
  */
#define __HAL_PWR_PVD_EXTI_DISABLE_IT() CLEAR_BIT(EXTI->IMR1, PWR_EXTI_LINE_PVD)

/**
  * @brief  Enable the PVD Event Line.
  * @retval None.
  */
#define __HAL_PWR_PVD_EXTI_ENABLE_EVENT() SET_BIT(EXTI->EMR1, PWR_EXTI_LINE_PVD)

/**
  * @brief  Disable the PVD Event Line.
  * @retval None.
  */
#define __HAL_PWR_PVD_EXTI_DISABLE_EVENT() CLEAR_BIT(EXTI->EMR1, PWR_EXTI_LINE_PVD)

/**
  * @brief  Enable the PVD Interrupt Rising Trigger.
  * @retval None.
  */
#define __HAL_PWR_PVD_EXTI_ENABLE_RISING_EDGE() SET_BIT(EXTI->RTSR1, PWR_EXTI_LINE_PVD)

/**
  * @brief  Disable the PVD Interrupt Rising Trigger.
  * @retval None.
  */
#define __HAL_PWR_PVD_EXTI_DISABLE_RISING_EDGE() CLEAR_BIT(EXTI->RTSR1, PWR_EXTI_LINE_PVD)

/**
  * @brief  Enable the PVD Interrupt Falling Trigger.
  * @retval None.
  */
#define __HAL_PWR_PVD_EXTI_ENABLE_FALLING_EDGE() SET_BIT(EXTI->FTSR1, PWR_EXTI_LINE_PVD)

/**
  * @brief  Disable the PVD Interrupt Falling Trigger.
  * @retval None.
  */
#define __HAL_PWR_PVD_EXTI_DISABLE_FALLING_EDGE() CLEAR_BIT(EXTI->FTSR1, PWR_EXTI_LINE_PVD)

/**
  * @brief  Enable the PVD Interrupt Rising & Falling Trigger.
  * @retval None.
  */
#define __HAL_PWR_PVD_EXTI_ENABLE_RISING_FALLING_EDGE() \
  do                                                    \
  {                                                     \
    __HAL_PWR_PVD_EXTI_ENABLE_RISING_EDGE();            \
    __HAL_PWR_PVD_EXTI_ENABLE_FALLING_EDGE();           \
  } while(0)

/**
  * @brief  Disable the PVD Interrupt Rising & Falling Trigger.
  * @retval None.
  */
#define __HAL_PWR_PVD_EXTI_DISABLE_RISING_FALLING_EDGE() \
  do                                                     \
  {                                                      \
    __HAL_PWR_PVD_EXTI_DISABLE_RISING_EDGE();            \
    __HAL_PWR_PVD_EXTI_DISABLE_FALLING_EDGE();           \
  } while(0)

/**
  * @brief  Generate a Software Interrupt on selected EXTI line.
  * @retval None
  */
#define __HAL_PWR_PVD_EXTI_GENERATE_SWIT() SET_BIT(EXTI->SWIER1, PWR_EXTI_LINE_PVD)

/**
  * @brief  Check whether or not the PVD EXTI interrupt Rising flag is set.
  * @retval EXTI PVD Line Status.
  */
#define __HAL_PWR_PVD_EXTI_GET_RISING_FLAG() (EXTI->RPR1 & PWR_EXTI_LINE_PVD)

/**
  * @brief  Check whether or not the PVD EXTI interrupt Falling flag is set.
  * @retval EXTI PVD Line Status.
  */
#define __HAL_PWR_PVD_EXTI_GET_FALLING_FLAG() (EXTI->FPR1 & PWR_EXTI_LINE_PVD)

/**
  * @brief  Clear the PVD EXTI interrupt Rising flag.
  * @retval None
  */
#define __HAL_PWR_PVD_EXTI_CLEAR_RISING_FLAG() WRITE_REG(EXTI->RPR1, PWR_EXTI_LINE_PVD)

/**
  * @brief  Clear the PVD EXTI interrupt Falling flag.
  * @retval None
  */
#define __HAL_PWR_PVD_EXTI_CLEAR_FALLING_FLAG()   WRITE_REG(EXTI->FPR1, PWR_EXTI_LINE_PVD)

/**
  * @brief  Enable the USBVM Interrupt Line.
  * @retval None.
  */
#define __HAL_PWR_USBVM_EXTI_ENABLE_IT() SET_BIT(EXTI->IMR1, PWR_EXTI_LINE_PVM_VDDUSB)

/**
  * @brief  Disable the USBVM Interrupt Line.
  * @retval None.
  */
#define __HAL_PWR_USBVM_EXTI_DISABLE_IT() CLEAR_BIT(EXTI->IMR1, PWR_EXTI_LINE_PVM_VDDUSB)

/**
  * @brief  Enable the USBVM Event Line.
  * @retval None.
  */
#define __HAL_PWR_USBVM_EXTI_ENABLE_EVENT() SET_BIT(EXTI->EMR1, PWR_EXTI_LINE_PVM_VDDUSB)

/**
  * @brief  Disable the USBVM Event Line.
  * @retval None.
  */
#define __HAL_PWR_USBVM_EXTI_DISABLE_EVENT() CLEAR_BIT(EXTI->EMR1, PWR_EXTI_LINE_PVM_VDDUSB)

/**
  * @brief  Enable the USBVM Interrupt Rising Trigger.
  * @retval None.
  */
#define __HAL_PWR_USBVM_EXTI_ENABLE_RISING_EDGE() SET_BIT(EXTI->RTSR1, PWR_EXTI_LINE_PVM_VDDUSB)

/**
  * @brief  Disable the USBVM Interrupt Rising Trigger.
  * @retval None.
  */
#define __HAL_PWR_USBVM_EXTI_DISABLE_RISING_EDGE() CLEAR_BIT(EXTI->RTSR1, PWR_EXTI_LINE_PVM_VDDUSB)

/**
  * @brief  Enable the USBVM Interrupt Falling Trigger.
  * @retval None.
  */
#define __HAL_PWR_USBVM_EXTI_ENABLE_FALLING_EDGE() SET_BIT(EXTI->FTSR1, PWR_EXTI_LINE_PVM_VDDUSB)

/**
  * @brief  Disable the USBVM Interrupt Falling Trigger.
  * @retval None.
  */
#define __HAL_PWR_USBVM_EXTI_DISABLE_FALLING_EDGE() CLEAR_BIT(EXTI->FTSR1, PWR_EXTI_LINE_PVM_VDDUSB)

/**
  * @brief  Enable the USBVM Interrupt Rising & Falling Trigger.
  * @retval None.
  */
#define __HAL_PWR_USBVM_EXTI_ENABLE_RISING_FALLING_EDGE() \
  do                                                      \
  {                                                       \
    __HAL_PWR_USBVM_EXTI_ENABLE_RISING_EDGE();            \
    __HAL_PWR_USBVM_EXTI_ENABLE_FALLING_EDGE();           \
  } while(0)

/**
  * @brief  Disable the USBVM Interrupt Rising & Falling Trigger.
  * @retval None.
  */
#define __HAL_PWR_USBVM_EXTI_DISABLE_RISING_FALLING_EDGE() \
  do                                                       \
  {                                                        \
    __HAL_PWR_USBVM_EXTI_DISABLE_RISING_EDGE();            \
    __HAL_PWR_USBVM_EXTI_DISABLE_FALLING_EDGE();           \
  } while(0)

/**
  * @brief  Generate a Software Interrupt on USBVM EXTI Line.
  * @retval None
  */
#define __HAL_PWR_USBVM_EXTI_GENERATE_SWIT() SET_BIT(EXTI->SWIER1, PWR_EXTI_LINE_PVM_VDDUSB)

/**
  * @brief  Check whether the specified USBVM EXTI flag is set or not.
  * @retval EXTI USBVM Line Status.
  */
#define __HAL_PWR_USBVM_EXTI_GET_FLAG() ((EXTI->RPR1 | EXTI->FPR1) & PWR_EXTI_LINE_PVM_VDDUSB)

/**
  * @brief  Clear the USBVM interrupt Rising flag.
  * @retval None.
  */
#define __HAL_PWR_USBVM_EXTI_CLEAR_RISING_FLAG() WRITE_REG(EXTI->RPR1, PWR_EXTI_LINE_PVM_VDDUSB)

/**
  * @brief  Clear the USBVM interrupt Falling flag.
  * @retval None
  */
#define __HAL_PWR_USBVM_EXTI_CLEAR_FALLING_FLAG() WRITE_REG(EXTI->FPR1, PWR_EXTI_LINE_PVM_VDDUSB)

#if defined(PWR_SVMCR_IO2VMEN)
/**
  * @brief  Enable the IO2VM Interrupt Line.
  * @retval None.
  */
#define __HAL_PWR_IO2VM_EXTI_ENABLE_IT() SET_BIT(EXTI->IMR1, PWR_EXTI_LINE_PVM_VDDIO2)

/**
  * @brief  Disable the IO2VM Interrupt Line.
  * @retval None.
  */
#define __HAL_PWR_IO2VM_EXTI_DISABLE_IT() CLEAR_BIT(EXTI->IMR1, PWR_EXTI_LINE_PVM_VDDIO2)

/**
  * @brief  Enable the IO2VM Event Line.
  * @retval None.
  */
#define __HAL_PWR_IO2VM_EXTI_ENABLE_EVENT() SET_BIT(EXTI->EMR1, PWR_EXTI_LINE_PVM_VDDIO2)

/**
  * @brief  Disable the IO2VM Event Line.
  * @retval None.
  */
#define __HAL_PWR_IO2VM_EXTI_DISABLE_EVENT() CLEAR_BIT(EXTI->EMR1, PWR_EXTI_LINE_PVM_VDDIO2)

/**
  * @brief  Enable the IO2VM Interrupt Rising Trigger.
  * @retval None.
  */
#define __HAL_PWR_IO2VM_EXTI_ENABLE_RISING_EDGE() SET_BIT(EXTI->RTSR1, PWR_EXTI_LINE_PVM_VDDIO2)

/**
  * @brief  Disable the IO2VM Interrupt Rising Trigger.
  * @retval None.
  */
#define __HAL_PWR_IO2VM_EXTI_DISABLE_RISING_EDGE() CLEAR_BIT(EXTI->RTSR1, PWR_EXTI_LINE_PVM_VDDIO2)

/**
  * @brief  Enable the IO2VM Interrupt Falling Trigger.
  * @retval None.
  */
#define __HAL_PWR_IO2VM_EXTI_ENABLE_FALLING_EDGE() SET_BIT(EXTI->FTSR1, PWR_EXTI_LINE_PVM_VDDIO2)

/**
  * @brief  Disable the IO2VM Interrupt Falling Trigger.
  * @retval None.
  */
#define __HAL_PWR_IO2VM_EXTI_DISABLE_FALLING_EDGE() CLEAR_BIT(EXTI->FTSR1, PWR_EXTI_LINE_PVM_VDDIO2)

/**
  * @brief  Enable the IO2VM Interrupt Rising & Falling Trigger.
  * @retval None.
  */
#define __HAL_PWR_IO2VM_EXTI_ENABLE_RISING_FALLING_EDGE() \
  do                                                      \
  {                                                       \
    __HAL_PWR_IO2VM_EXTI_ENABLE_RISING_EDGE();            \
    __HAL_PWR_IO2VM_EXTI_ENABLE_FALLING_EDGE();           \
  } while(0)

/**
  * @brief  Disable the IO2VM Interrupt Rising & Falling Trigger.
  * @retval None.
  */
#define __HAL_PWR_IO2VM_EXTI_DISABLE_RISING_FALLING_EDGE() \
  do                                                       \
  {                                                        \
    __HAL_PWR_IO2VM_EXTI_DISABLE_RISING_EDGE();            \
    __HAL_PWR_IO2VM_EXTI_DISABLE_FALLING_EDGE();           \
  } while(0)

/**
  * @brief  Generate a Software Interrupt on IO2VM EXTI Line.
  * @retval None
  */
#define __HAL_PWR_IO2VM_EXTI_GENERATE_SWIT() SET_BIT(EXTI->SWIER1, PWR_EXTI_LINE_PVM_VDDIO2)

/**
  * @brief  Check whether the specified IO2VM EXTI flag is set or not.
  * @retval EXTI IO2VM Line Status.
  */
#define __HAL_PWR_IO2VM_EXTI_GET_FLAG() ((EXTI->RPR1 | EXTI->FPR1) & PWR_EXTI_LINE_PVM_VDDIO2)

/**
  * @brief  Clear the IO2VM interrupt Rising flag.
  * @retval None.
  */
#define __HAL_PWR_IO2VM_EXTI_CLEAR_RISING_FLAG() WRITE_REG(EXTI->RPR1, PWR_EXTI_LINE_PVM_VDDIO2)

/**
  * @brief  Clear the IO2VM interrupt Falling flag.
  * @retval None
  */
#define __HAL_PWR_IO2VM_EXTI_CLEAR_FALLING_FLAG() WRITE_REG(EXTI->FPR1, PWR_EXTI_LINE_PVM_VDDIO2)
#endif /* PWR_SVMCR_IO2VMEN */

/**
  * @brief  Enable the ADCVM1 Interrupt Line.
  * @retval None.
  */
#define __HAL_PWR_ADCVM1_EXTI_ENABLE_IT() SET_BIT(EXTI->IMR1, PWR_EXTI_LINE_PVM_VDDA1)

/**
  * @brief  Disable the ADCVM1 Interrupt Line.
  * @retval None.
  */
#define __HAL_PWR_ADCVM1_EXTI_DISABLE_IT() CLEAR_BIT(EXTI->IMR1, PWR_EXTI_LINE_PVM_VDDA1)

/**
  * @brief  Enable the ADCVM1 Event Line.
  * @retval None.
  */
#define __HAL_PWR_ADCVM1_EXTI_ENABLE_EVENT() SET_BIT(EXTI->EMR1, PWR_EXTI_LINE_PVM_VDDA1)

/**
  * @brief  Disable the ADCVM1 Event Line.
  * @retval None.
  */
#define __HAL_PWR_ADCVM1_EXTI_DISABLE_EVENT() CLEAR_BIT(EXTI->EMR1, PWR_EXTI_LINE_PVM_VDDA1)

/**
  * @brief  Enable the ADCVM1 Interrupt Rising Trigger.
  * @retval None.
  */
#define __HAL_PWR_ADCVM1_EXTI_ENABLE_RISING_EDGE() SET_BIT(EXTI->RTSR1, PWR_EXTI_LINE_PVM_VDDA1)

/**
  * @brief  Disable the ADCVM1 Interrupt Rising Trigger.
  * @retval None.
  */
#define __HAL_PWR_ADCVM1_EXTI_DISABLE_RISING_EDGE() CLEAR_BIT(EXTI->RTSR1, PWR_EXTI_LINE_PVM_VDDA1)

/**
  * @brief  Enable the ADCVM1 Interrupt Falling Trigger.
  * @retval None.
  */
#define __HAL_PWR_ADCVM1_EXTI_ENABLE_FALLING_EDGE() SET_BIT(EXTI->FTSR1, PWR_EXTI_LINE_PVM_VDDA1)

/**
  * @brief  Disable the ADCVM1 Interrupt Falling Trigger.
  * @retval None.
  */
#define __HAL_PWR_ADCVM1_EXTI_DISABLE_FALLING_EDGE() CLEAR_BIT(EXTI->FTSR1, PWR_EXTI_LINE_PVM_VDDA1)

/**
  * @brief  Enable the ADCVM1 Interrupt Rising & Falling Trigger.
  * @retval None.
  */
#define __HAL_PWR_ADCVM1_EXTI_ENABLE_RISING_FALLING_EDGE() \
  do                                                       \
  {                                                        \
    __HAL_PWR_ADCVM1_EXTI_ENABLE_RISING_EDGE();            \
    __HAL_PWR_ADCVM1_EXTI_ENABLE_FALLING_EDGE();           \
  } while(0)

/**
  * @brief  Disable the ADCVM1 Interrupt Rising & Falling Trigger.
  * @retval None.
  */
#define __HAL_PWR_ADCVM1_EXTI_DISABLE_RISING_FALLING_EDGE() \
  do                                                        \
  {                                                         \
    __HAL_PWR_ADCVM1_EXTI_DISABLE_RISING_EDGE();            \
    __HAL_PWR_ADCVM1_EXTI_DISABLE_FALLING_EDGE();           \
  } while(0)

/**
  * @brief  Generate a Software Interrupt on ADCVM1 EXTI Line.
  * @retval None
  */
#define __HAL_PWR_ADCVM1_EXTI_GENERATE_SWIT() SET_BIT(EXTI->SWIER1, PWR_EXTI_LINE_PVM_VDDA1)

/**
  * @brief  Check whether the specified ADCVM1 EXTI flag is set or not.
  * @retval EXTI ADCVM1 Line Status.
  */
#define __HAL_PWR_ADCVM1_EXTI_GET_FLAG() ((EXTI->RPR1 | EXTI->FPR1) & PWR_EXTI_LINE_PVM_VDDA1)

/**
  * @brief  Clear the ADCVM1 interrupt Rising flag.
  * @retval None.
  */
#define __HAL_PWR_ADCVM1_EXTI_CLEAR_RISING_FLAG() WRITE_REG(EXTI->RPR1, PWR_EXTI_LINE_PVM_VDDA1)

/**
  * @brief  Clear the ADCVM1 interrupt Falling flag.
  * @retval None
  */
#define __HAL_PWR_ADCVM1_EXTI_CLEAR_FALLING_FLAG() WRITE_REG(EXTI->FPR1, PWR_EXTI_LINE_PVM_VDDA1)

/**
  * @brief  Enable the ADCVM2 Interrupt Line.
  * @retval None.
  */
#define __HAL_PWR_ADCVM2_EXTI_ENABLE_IT() SET_BIT(EXTI->IMR1, PWR_EXTI_LINE_PVM_VDDA2)

/**
  * @brief  Disable the ADCVM2 Interrupt Line.
  * @retval None.
  */
#define __HAL_PWR_ADCVM2_EXTI_DISABLE_IT() CLEAR_BIT(EXTI->IMR1, PWR_EXTI_LINE_PVM_VDDA2)

/**
  * @brief  Enable the ADCVM2 Event Line.
  * @retval None.
  */
#define __HAL_PWR_ADCVM2_EXTI_ENABLE_EVENT() SET_BIT(EXTI->EMR1, PWR_EXTI_LINE_PVM_VDDA2)

/**
  * @brief  Disable the ADCVM2 Event Line.
  * @retval None.
  */
#define __HAL_PWR_ADCVM2_EXTI_DISABLE_EVENT() CLEAR_BIT(EXTI->EMR1, PWR_EXTI_LINE_PVM_VDDA2)

/**
  * @brief  Enable the ADCVM2 Interrupt Rising Trigger.
  * @retval None.
  */
#define __HAL_PWR_ADCVM2_EXTI_ENABLE_RISING_EDGE() SET_BIT(EXTI->RTSR1, PWR_EXTI_LINE_PVM_VDDA2)

/**
  * @brief  Disable the ADCVM2 Interrupt Rising Trigger.
  * @retval None.
  */
#define __HAL_PWR_ADCVM2_EXTI_DISABLE_RISING_EDGE() CLEAR_BIT(EXTI->RTSR1, PWR_EXTI_LINE_PVM_VDDA2)

/**
  * @brief  Enable the ADCVM2 Interrupt Falling Trigger.
  * @retval None.
  */
#define __HAL_PWR_ADCVM2_EXTI_ENABLE_FALLING_EDGE() SET_BIT(EXTI->FTSR1, PWR_EXTI_LINE_PVM_VDDA2)

/**
  * @brief  Disable the ADCVM2 Interrupt Falling Trigger.
  * @retval None.
  */
#define __HAL_PWR_ADCVM2_EXTI_DISABLE_FALLING_EDGE() CLEAR_BIT(EXTI->FTSR1, PWR_EXTI_LINE_PVM_VDDA2)

/**
  * @brief  Enable the ADCVM2 Interrupt Rising & Falling Trigger.
  * @retval None.
  */
#define __HAL_PWR_ADCVM2_EXTI_ENABLE_RISING_FALLING_EDGE() \
  do                                                       \
  {                                                        \
    __HAL_PWR_ADCVM2_EXTI_ENABLE_RISING_EDGE();            \
    __HAL_PWR_ADCVM2_EXTI_ENABLE_FALLING_EDGE();           \
  } while(0)

/**
  * @brief  Disable the ADCVM2 Interrupt Rising & Falling Trigger.
  * @retval None.
  */
#define __HAL_PWR_ADCVM2_EXTI_DISABLE_RISING_FALLING_EDGE() \
  do                                                        \
  {                                                         \
    __HAL_PWR_ADCVM2_EXTI_DISABLE_RISING_EDGE();            \
    __HAL_PWR_ADCVM2_EXTI_DISABLE_FALLING_EDGE();           \
  } while(0)

/**
  * @brief  Generate a Software Interrupt on ADCVM2 EXTI Line.
  * @retval None
  */
#define __HAL_PWR_ADCVM2_EXTI_GENERATE_SWIT() SET_BIT(EXTI->SWIER1, PWR_EXTI_LINE_PVM_VDDA2)

/**
  * @brief  Check whether the specified ADCVM2 EXTI flag is set or not.
  * @retval EXTI ADCVM2 Line Status.
  */
#define __HAL_PWR_ADCVM2_EXTI_GET_FLAG() ((EXTI->RPR1 | EXTI->FPR1) & PWR_EXTI_LINE_PVM_VDDA2)

/**
  * @brief  Clear the ADCVM2 interrupt Rising flag.
  * @retval None.
  */
#define __HAL_PWR_ADCVM2_EXTI_CLEAR_RISING_FLAG() WRITE_REG(EXTI->RPR1, PWR_EXTI_LINE_PVM_VDDA2)

/**
  * @brief  Clear the ADCVM2 interrupt Falling flag.
  * @retval None
  */
#define __HAL_PWR_ADCVM2_EXTI_CLEAR_FALLING_FLAG() WRITE_REG(EXTI->FPR1, PWR_EXTI_LINE_PVM_VDDA2)
/**
  * @}
  */

/* Private constants ---------------------------------------------------------*/

