stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_hal_pwr.h
/** @addtogroup PWR_Private_Constants PWR Private Constants
  * @{
  */

/** @defgroup PWR_PVD_EXTI_Line PWR PVD EXTI Line
  * @{
  */
#define PWR_EXTI_LINE_PVD              EXTI_IMR1_IM16                          /*!< PVD EXTI Line */
/**
  * @}
  */

/** @defgroup PWR_PVM_EXTI PWR PVM interrupts and event lines defines
  * @{
  */
#define PWR_EXTI_LINE_PVM_VDDUSB       EXTI_IMR1_IM19       /*!< PVM VDDUSB voltage monitor EXTI Line */
#if defined(PWR_SVMCR_IO2VMEN)
#define PWR_EXTI_LINE_PVM_VDDIO2       EXTI_IMR1_IM20       /*!< PVM VDDIO2 voltage monitor EXTI Line */
#endif /* PWR_SVMCR_IO2VMEN */
#define PWR_EXTI_LINE_PVM_VDDA1        EXTI_IMR1_IM21       /*!< PVM VDDA voltage monitor 1 EXTI Line */
#define PWR_EXTI_LINE_PVM_VDDA2        EXTI_IMR1_IM22       /*!< PVM VDDA voltage monitor 2 EXTI Line */
/**
  * @}
  */

/** @defgroup PWR_PVM_Type PWR Voltage Monitoring Type
  * @{
  */
#define PWR_VDDUSB_VM                  (0U)                 /*!< Independent USB voltage monitor    */
#if defined(PWR_SVMCR_IO2VMEN)
#define PWR_VDDIO2_VM                  (1U)                 /*!< Independent VDDIO2 voltage monitor */
#endif /* PWR_SVMCR_IO2VMEN */
#define PWR_VDDA_VM1                   (2U)                 /*!< Independent VDDA voltage monitor 1 */
#define PWR_VDDA_VM2                   (3U)                 /*!< Independent VDDA voltage monitor 2 */
/**
  * @}
  */

/* Defines attribute */
#define PWR_ITEM_ATTR_NSEC_PRIV_MASK   (0x10U)              /*!< NSecure Privilege / NPrivilege attribute item mask */
#define PWR_ITEM_ATTR_SEC_PRIV_MASK    (0x20U)              /*!< Secure Privilege / NPrivilege attribute item mask  */
/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/

/** @addtogroup PWR_Private_Macros PWR Private Macros
  * @{
  */

/* Stop mode entry check macro */
#define IS_PWR_STOPMODE(__MODE__)  (((__MODE__) == PWR_LOWPOWERMODE_STOP0) ||\
                                    ((__MODE__) == PWR_LOWPOWERMODE_STOP1) ||\
                                    ((__MODE__) == PWR_LOWPOWERMODE_STOP2) ||\
                                    ((__MODE__) == PWR_LOWPOWERMODE_STOP3))

/* Wake up lines check macro */
#define IS_PWR_WAKEUP_LINE(__LINE__) (((__LINE__) == PWR_WAKEUP_LINE1) ||\
                                      ((__LINE__) == PWR_WAKEUP_LINE2) ||\
                                      ((__LINE__) == PWR_WAKEUP_LINE3) ||\
                                      ((__LINE__) == PWR_WAKEUP_LINE4) ||\
                                      ((__LINE__) == PWR_WAKEUP_LINE5) ||\
                                      ((__LINE__) == PWR_WAKEUP_LINE6) ||\
                                      ((__LINE__) == PWR_WAKEUP_LINE7) ||\
                                      ((__LINE__) == PWR_WAKEUP_LINE8) ||\
                                      ((__LINE__) == PWR_WAKEUP_LINE9) ||\
                                      ((__LINE__) == PWR_WAKEUP_LINE10))

/* Wake up lines polarity check macro */
#define IS_PWR_WAKEUP_POLARITY(__POLARITY__) (((__POLARITY__) == PWR_WAKEUP_POLARITY_HIGH) ||\
                                              ((__POLARITY__) == PWR_WAKEUP_POLARITY_LOW))

/* Wake up lines selection check macro */
#define IS_PWR_WAKEUP_SELECTION(__SELECTION__) (((__SELECTION__) == PWR_WAKEUP_SELECT_0) ||\
                                                ((__SELECTION__) == PWR_WAKEUP_SELECT_1) ||\
                                                ((__SELECTION__) == PWR_WAKEUP_SELECT_2) ||\
                                                ((__SELECTION__) == PWR_WAKEUP_SELECT_3))


/* PVD level check macro */
#define IS_PWR_PVD_LEVEL(__LEVEL__) (((__LEVEL__) == PWR_PVDLEVEL_0) || ((__LEVEL__) == PWR_PVDLEVEL_1) || \
                                     ((__LEVEL__) == PWR_PVDLEVEL_2) || ((__LEVEL__) == PWR_PVDLEVEL_3) || \
                                     ((__LEVEL__) == PWR_PVDLEVEL_4) || ((__LEVEL__) == PWR_PVDLEVEL_5) || \
                                     ((__LEVEL__) == PWR_PVDLEVEL_6) || ((__LEVEL__) == PWR_PVDLEVEL_7))

/* PVD mode check macro */
#define IS_PWR_PVD_MODE(__MODE__) (((__MODE__) == PWR_PVD_MODE_NORMAL)               ||\
                                   ((__MODE__) == PWR_PVD_MODE_IT_RISING)            ||\
                                   ((__MODE__) == PWR_PVD_MODE_IT_FALLING)           ||\
                                   ((__MODE__) == PWR_PVD_MODE_IT_RISING_FALLING)    ||\
                                   ((__MODE__) == PWR_PVD_MODE_EVENT_RISING)         ||\
                                   ((__MODE__) == PWR_PVD_MODE_EVENT_FALLING)        ||\
                                   ((__MODE__) == PWR_PVD_MODE_EVENT_RISING_FALLING))

/* Sleep mode entry check macro */
#define IS_PWR_SLEEP_ENTRY(__ENTRY__) (((__ENTRY__) == PWR_SLEEPENTRY_WFI) ||\
                                       ((__ENTRY__) == PWR_SLEEPENTRY_WFE) ||\
                                       ((__ENTRY__) == PWR_SLEEPENTRY_WFE_NO_EVT_CLEAR))

/* Stop mode entry check macro */
#define IS_PWR_STOP_ENTRY(__ENTRY__) (((__ENTRY__) == PWR_STOPENTRY_WFI) ||\
                                      ((__ENTRY__) == PWR_STOPENTRY_WFE) ||\
                                      ((__ENTRY__) == PWR_STOPENTRY_WFE_NO_EVT_CLEAR))

/* PWR items check macro */
#define IS_PWR_ITEMS_ATTRIBUTES(__ITEM__) ((((__ITEM__) & (~PWR_ALL)) == 0U) && ((__ITEM__) != 0U))

#if defined (CPU_IN_SECURE_STATE)
/* PWR attribute check macro (Secure) */
#define IS_PWR_ATTRIBUTES(__ATTRIBUTES__) ((((~(((__ATTRIBUTES__)& \
                                                 0xF0U) >> 4U)) & ((__ATTRIBUTES__) & 0x0FU)) == 0U) && \
                                           (((__ATTRIBUTES__) & 0xFFFFFFCCU) == 0U))
#else
/* PWR attribute check macro (NSecure) */
#define IS_PWR_ATTRIBUTES(__ATTRIBUTES__) (((__ATTRIBUTES__) == PWR_NSEC_NPRIV) || ((__ATTRIBUTES__) == PWR_NSEC_PRIV))
#endif /* defined (CPU_IN_SECURE_STATE) */

/* Check PVM type parameter */
#if defined(PWR_SVMCR_IO2VMEN)
#define IS_PWR_PVM_TYPE(__TYPE__)  \
  (((__TYPE__) == PWR_VDDUSB_VM) ||\
   ((__TYPE__) == PWR_VDDIO2_VM) ||\
   ((__TYPE__) == PWR_VDDA_VM1) ||\
   ((__TYPE__) == PWR_VDDA_VM2))
#else
#define IS_PWR_PVM_TYPE(__TYPE__)  \
  (((__TYPE__) == PWR_VDDUSB_VM) ||\
   ((__TYPE__) == PWR_VDDA_VM1) ||\
   ((__TYPE__) == PWR_VDDA_VM2))
#endif /* PWR_SVMCR_IO2VMEN */

/* Check PVM mode check parameter */
#define IS_PWR_PVM_MODE(__MODE__)                   \
  (((__MODE__) == PWR_PVM_MODE_NORMAL)            ||\
   ((__MODE__) == PWR_PVM_MODE_IT_RISING)         ||\
   ((__MODE__) == PWR_PVM_MODE_IT_FALLING)        ||\
   ((__MODE__) == PWR_PVM_MODE_IT_RISING_FALLING) ||\
   ((__MODE__) == PWR_PVM_MODE_EVENT_RISING)      ||\
   ((__MODE__) == PWR_PVM_MODE_EVENT_FALLING)     ||\
   ((__MODE__) == PWR_PVM_MODE_EVENT_RISING_FALLING))
/**
  * @}
  */

