stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_hal_pwr.h
/* Include PWR HAL Extended module */
#include "stm32u3xx_hal_pwr_ex.h"

/* Exported functions --------------------------------------------------------*/

/** @addtogroup PWR_Exported_Functions PWR Exported Functions
  * @{
  */

/** @addtogroup PWR_Exported_Functions_Group1
  * @{
  */
/* Initialization and de-initialization functions *****************************/
void HAL_PWR_DeInit(void);
void HAL_PWR_EnableBkUpAccess(void);
void HAL_PWR_DisableBkUpAccess(void);
/**
  * @}
  */

/** @addtogroup PWR_Exported_Functions_Group2
  * @{
  */
/* Programmable voltage detector functions ************************************/
HAL_StatusTypeDef HAL_PWR_ConfigPVD(const PWR_PVDTypeDef *sConfigPVD);
void              HAL_PWR_EnablePVD(void);
void              HAL_PWR_DisablePVD(void);

/* Wake up lines configuration functions ***************************************/
void     HAL_PWR_EnableWakeUpLine(uint32_t WakeUpLine, uint32_t Selection, uint32_t Polarity);
void     HAL_PWR_DisableWakeUpLine(uint32_t WakeUpLine);
uint32_t HAL_PWR_GetClearWakeupSource(void);

/* Low power modes configuration functions ************************************/
void HAL_PWR_EnterSLEEPMode(uint32_t Regulator, uint8_t SLEEPEntry);
void HAL_PWR_EnterSTOPMode(uint32_t StopMode, uint8_t STOPEntry);
void HAL_PWR_EnterSTANDBYMode(void);

/* Sleep on exit and sev on pending configuration functions *******************/
void HAL_PWR_EnableSleepOnExit(void);
void HAL_PWR_DisableSleepOnExit(void);
void HAL_PWR_EnableSEVOnPend(void);
void HAL_PWR_DisableSEVOnPend(void);

/* Programmable voltage monitor functions ************************************/
void              HAL_PWR_EnableVddUSBVoltageMonitor(void);
void              HAL_PWR_DisableVddUSBVoltageMonitor(void);
#if defined(PWR_SVMCR_IO2VMEN)
void              HAL_PWR_EnableVddIO2VoltageMonitor(void);
void              HAL_PWR_DisableVddIO2VoltageMonitor(void);
#endif /* PWR_SVMCR_IO2VMEN */
void              HAL_PWR_EnableVddA1VoltageMonitor(void);
void              HAL_PWR_DisableVddA1VoltageMonitor(void);
void              HAL_PWR_EnableVddA2VoltageMonitor(void);
void              HAL_PWR_DisableVddA2VoltageMonitor(void);
HAL_StatusTypeDef HAL_PWR_ConfigPVM(const PWR_PVMTypeDef *pConfigPVM);

/* Interrupt handler functions ************************************************/
void HAL_PWR_PVD_PVM_IRQHandler(void);
void HAL_PWR_PVD_Rising_Callback(void);
void HAL_PWR_PVD_Falling_Callback(void);
void HAL_PWR_USBVM_Rising_Callback(void);
void HAL_PWR_USBVM_Falling_Callback(void);
#if defined(PWR_SVMCR_IO2VMEN)
void HAL_PWR_IO2VM_Rising_Callback(void);
void HAL_PWR_IO2VM_Falling_Callback(void);
#endif /* PWR_SVMCR_IO2VMEN */
void HAL_PWR_ADCVM1_Rising_Callback(void);
void HAL_PWR_ADCVM1_Falling_Callback(void);
void HAL_PWR_ADCVM2_Rising_Callback(void);
void HAL_PWR_ADCVM2_Falling_Callback(void);
void HAL_PWR_WKUP_IRQHandler(void);
void HAL_PWR_WKUP1_Callback(void);
void HAL_PWR_WKUP2_Callback(void);
void HAL_PWR_WKUP3_Callback(void);
void HAL_PWR_WKUP4_Callback(void);
void HAL_PWR_WKUP5_Callback(void);
void HAL_PWR_WKUP6_Callback(void);
void HAL_PWR_WKUP7_Callback(void);
void HAL_PWR_WKUP8_Callback(void);
void HAL_PWR_WKUP9_Callback(void);
void HAL_PWR_WKUP10_Callback(void);
/**
  * @}
  */

/** @addtogroup PWR_Exported_Functions_Group3
  * @{
  */
/* Privileges and security configuration functions ****************************/
void              HAL_PWR_ConfigAttributes(uint32_t Item, uint32_t Attributes);
HAL_StatusTypeDef HAL_PWR_GetConfigAttributes(uint32_t Item, uint32_t *pAttributes);
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* STM32U3xx_HAL_PWR_H */
